In [1]:
#to access single cell in dataFrame.

import pandas as pd
df=pd.read_csv("CollegePlacement.csv")
df

,Age,Gender,Stream,Internships,CGPA,Hostel,HistoryOfBacklogs,PlacedOrNot
0,22,Male,Electronics And Communication,1,8,1,1,1
1,21,Female,Computer Science,0,7,1,1,1
2,22,Female,Information Technology,1,6,0,0,1
3,21,Male,Information Technology,0,8,0,1,1
4,22,Male,Mechanical,0,8,1,0,1
...,...,...,...,...,...,...,...,...
2961,23,Male,Information Technology,0,7,0,0,0
2962,23,Male,Mechanical,1,7,1,0,0
2963,22,Male,Information Technology,1,7,0,0,0
2964,22,Male,Computer Science,1,7,0,0,0
2965,23,Male,Civil,0,8,0,0,1

In [77]:
import numpy as np
from numpy import random
random.seed(10)
df1=pd.DataFrame(np.random.randint(12,20,(5,4)),columns=list("ABCD"),index=list("TAKEC"))
df1

    A   B   C   D
T  13  17  16  19
A  12  13  15  16
K  13  17  12  17
E  13  14  12  13
C  12  14  12  18

In [90]:
df.at[4,"Age"]

22

In [57]:
df1.at["T","A"]

13

In [103]:
from datetime import datetime
dates=pd.date_range("20190601",periods=5)
df1.index=dates
d=datetime(2019, 6, 3, 0, 0)
# df1["2019-06-02"
print(df1.at[df1.index[3],"D"])

13

In [112]:
df1[(df1.A>12) & (df1.B>14)]

             A   B   C   D
2019-06-01  13  17  16  19
2019-06-03  13  17  12  17

In [114]:
isinstance(df1.A,pd.Series)

True